def filter_by_currency(transactions, currency):
    """Функция принимает на вход список словарей,
    представляющих транзакции.Функция должна возвращать итератор,
    который поочередно выдает транзакции,
    где валюта операции соответствует заданной (например, USD)."""
    for transaction in transactions:
        if transaction['operationAmount']['currency']['code'] == currency:
            yield transaction


def transaction_descriptions():
    """Функция принимает список словарей с транзакциями
    и возвращает описание каждой операции по очереди."""
    pass


def card_number_generator(start, stop):
    """Генератор, который выдает номера банковских карт в формате
    XXXX XXXX XXXX XXXX , где X — цифра номера карты.
    Генератор может сгенерировать номера карт в заданном диапазоне от
    0000 0000 0000 0001 до 9999 9999 9999 9999.
    Генератор должен принимать начальное и
    конечное значения для генерации диапазона номеров."""
    pass


